# **범주형 데이터 다루기 - 원핫인코딩 (One Hot Encoding)**

데이터에는 수치형 데이터와 텍스트 데이터 그리고 범주형 데이터가 있다. 머신러닝이나 딥러닝 알고리즘은 수치로 된 데이터만 이해할 수 있다. 그래서 기계가 이해할 수 있는 형태로 데이터를 변환해야 하는데 범주형 데이터는 원핫인코딩 형태로 변환해 준다.
<br><br>
**원핫인코딩이란 해당하는 하나의 데이터만 1로 변경해주고 나머지는 0으로 채워주는 것을 뜻한다.**
예를 들어 과일이라는 컬럼에 사과, 배, 감이 들어있을 때, 개별 과일인 사과, 배, 감으로 컬럼을 만들어 주고 해당하는 과일에만 1로 표기해주고 나머지 과일은 0으로 표기해주는 것이다.
<br><br>
원핫인코딩은 파이썬 코드로 직접 구현할 수 있으며, 판다스나 사이킷런을 사용하여 구현할 수도 있다.

---

In [0]:
import pandas as pd
import numpy as np

In [2]:
# 판다스를 통해 데이터 불러오기
# 데이터 출처: https://www.kaggle.com/c/titanic/data

train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

print(train.shape)
print(test.shape)

(891, 12)
(418, 11)

In [3]:
# dtypes -> data types
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
test.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [5]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
# 수치형 데이터에 대한 정보 확인하기
# 데이터의 수량, 최대값, 최소값, 평균값 그리고 중간값 등을 확인할 수 있다.
train.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

---

In [9]:
# 오브젝트 타입의 데이터만 따로 추출
# 데이터 중 카테고리 형태의 데이터가 무엇인지 보고 인코딩 해준다.
# 원핫인코딩 뿐만 아니라 자연어처리(NLP)에서 배운 TF, TF-IDF의 인코딩도 가능하다.

# dtype으로 팬더 열 선택
# df = pd.DataFrame([[1, 2.2, 'three']], columns=['A', 'B', 'C'])
# df.select_dtypes(include=['int']) -> 1
# df.select_dtypes(include=[np.number]) -> 1, 2.2
# df.select_dtypes(exclude=[object]) -> 1, 2.2
# https://cnpnote.tistory.com/entry/PYTHON-dtype%EC%9C%BC%EB%A1%9C-%ED%8C%AC%EB%8D%94-%EC%97%B4-%EC%84%A0%ED%83%9D

obj_df = train.select_dtypes(include = ['object']).copy()
obj_df.head()

                                                Name     Sex  ... Cabin Embarked
0                            Braund, Mr. Owen Harris    male  ...   NaN        S
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  ...   C85        C
2                             Heikkinen, Miss. Laina  female  ...   NaN        S
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  ...  C123        S
4                           Allen, Mr. William Henry    male  ...   NaN        S

[5 rows x 5 columns]

In [11]:
# 어느 데이터든 누락된 데이터가 있으면 출력한다.
# Cabin이 누락된 데이터가 가장 많다.
obj_df[obj_df.isnull().any(axis = 1)].head(20)

                                                 Name     Sex  ... Cabin Embarked
0                             Braund, Mr. Owen Harris    male  ...   NaN        S
2                              Heikkinen, Miss. Laina  female  ...   NaN        S
4                            Allen, Mr. William Henry    male  ...   NaN        S
5                                    Moran, Mr. James    male  ...   NaN        Q
7                      Palsson, Master. Gosta Leonard    male  ...   NaN        S
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  ...   NaN        S
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  ...   NaN        C
12                     Saundercock, Mr. William Henry    male  ...   NaN        S
13                        Andersson, Mr. Anders Johan    male  ...   NaN        S
14               Vestrom, Miss. Hulda Amanda Adolfina  female  ...   NaN        S
15                   Hewlett, Mrs. (Mary D Kingcome)   female  ...   NaN        S
16                               Rice, Master. Eugene    male  ...   NaN        Q
17                       Williams, Mr. Charles Eugene    male  ...   NaN        S
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  ...   NaN        S
19                            Masselmani, Mrs. Fatima  female  ...   NaN        C
20                               Fynney, Mr. Joseph J    male  ...   NaN        S
22                        McGowan, Miss. Anna "Annie"  female  ...   NaN        Q
24                      Palsson, Miss. Torborg Danira  female  ...   NaN        S
25  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  ...   NaN        S
26                            Emir, Mr. Farred Chehab    male  ...   NaN        C

[20 rows x 5 columns]

In [13]:
# 카테고리 데이터로 적합한지 확인하기
obj_df['Cabin'].value_counts().head(5)

C23 C25 C27    4
B96 B98        4
G6             4
D              3
E101           3
Name: Cabin, dtype: int64

In [0]:
# 처리전과 비교하기 위해 데이터 복사하기
train_c_df = train.copy()
test_c_df = train.copy()

---
## **성별**

In [18]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [0]:
# 성별은 남성 / 여성, 둘로 나뉘기 때문에 0, 1로 구분할 수 있다.
# 첫번째 방법
train.loc[train['Sex'] == "male", "Sex"] = 0
train.loc[train['Sex'] == "female", "Sex"] = 1

test.loc[test["Sex"] == "male", "Sex"] = 0
test.loc[test["Sex"] == "female", "Sex"] = 1

In [0]:
# 두번째 방법
# data['Sex'] = data['Sex'].apply(lambda s: 1 if s == 'female' else 0)
# testdata['Sex'] = testdata['Sex'].apply(lambda s: 1 if s == 'female' else 0)

In [22]:
train.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 12 columns]

## **사이킷런의 LabelEncoder로 원핫인코딩**

In [23]:
# 카테고리 데이터를 인코딩 해준다.
from sklearn.preprocessing import LabelEncoder

# 성별을 0과 1로 인코딩
def gender_to_int(data):
    le = LabelEncoder()
    le.fit(['male', 'female'])
    data['Sex'] = le.transform(data['Sex'])
    return data

train_c_df = gender_to_int(train_c_df)
test_c_df = gender_to_int(test_c_df)
test_c_df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 12 columns]

---

## **승선위치**

In [24]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [26]:
train_c_df["Embarked_C"] = train_c_df['Embarked'] == "C"
train_c_df["Embarked_S"] = train_c_df['Embarked'] == "S"
train_c_df["Embarked_Q"] = train_c_df['Embarked'] == "Q"

print(train.shape)
print(train_c_df.shape)

train_c_df[["Embarked", "Embarked_C", "Embarked_S", "Embarked_Q"]].head(10)

(891, 12)
(891, 15)

  Embarked  Embarked_C  Embarked_S  Embarked_Q
0        S       False        True       False
1        C        True       False       False
2        S       False        True       False
3        S       False        True       False
4        S       False        True       False
5        Q       False       False        True
6        S       False        True       False
7        S       False        True       False
8        S       False        True       False
9        C        True       False       False

---

## **판다스의 get_dummies로 원핫인코딩**

In [34]:
# 기계가 데이터를 이해할 수 있도록 카테고리 데이터를 one-hot-encoding 해준다.

def dummy_data(data, columns):
    for column in columns:
        data = pd.concat([data, pd.get_dummies(data[column], prefix = column)],
                        axis = 1)
        data = data.drop(column, axis = 1)
    return data


dummy_columns = ['Sex', 'Pclass', 'Embarked']

train_dummy = dummy_data(train, dummy_columns)
test_dummy = dummy_data(test, dummy_columns)

print('원핫인코딩 전 shape')
print(train.shape)
print(test.shape)

print('get_dummies로 원핫인코딩 후 shape')
print(train_dummy.shape)
print(test_dummy.shape)

원핫인코딩 전 shape
(891, 12)
(418, 11)
get_dummies로 원핫인코딩 후 shape
(891, 17)
(418, 16)

In [29]:
train_dummy.head()

   PassengerId  Survived  ... Embarked_Q  Embarked_S
0            1         0  ...          0           1
1            2         1  ...          0           0
2            3         1  ...          0           1
3            4         1  ...          0           1
4            5         0  ...          0           1

[5 rows x 17 columns]

* **위처럼 다양한 방법으로 인코딩된 데이터를 그대로 사용하면 사용하지 않는 컬럼을 drop하여 피처를 생성해준다.**

In [0]:
# 사용하지 않을 컬럼을 제거하여 피처로 사용할 컬럼만 남긴다.

def drop_not_concerned(data, columns):
    return data.drop(columns, axis = 1)


not_concerned_columns = ["PassengerId", "Name", "Ticket", "Cabin"]
X_train = drop_not_concerned(train_dummy, not_concerned_columns)
X_train = X_train.drop('Survived', axis = 1)
X_test = drop_not_concerned(test_dummy, not_concerned_columns)

In [32]:
X_train.head()

    Age  SibSp  Parch     Fare  ...  Pclass_3  Embarked_C  Embarked_Q  Embarked_S
0  22.0      1      0   7.2500  ...         1           0           0           1
1  38.0      1      0  71.2833  ...         0           1           0           0
2  26.0      0      0   7.9250  ...         1           0           0           1
3  35.0      1      0  53.1000  ...         0           0           0           1
4  35.0      0      0   8.0500  ...         1           0           0           1

[5 rows x 12 columns]